{
  "document_id": "hostel-rule-book-2025-26.pdf",
  "version": "v1.1",
  "chunks": [
    {
      "id": "chunk-001",
      "doc_id": "hostel-rule-book-2025-26.pdf",
      "page_start": 1,
      "page_end": 2,
      "section": "Introduction",
      "chunk_text": "HOSTEL RULE BOOK 2025-26\nThis rule book contains the guidelines and regulations for all hostel residents for the academic year 2025-26. All students are required to read and adhere to the rules mentioned herein.\n\n1. GENERAL GUIDELINES\nAll residents must maintain discipline and decorum within the hostel premises. Any act of indiscipline will be dealt with strictly as per the hostel regulations. Residents are expected to respect hostel staff and fellow students at all times.\n\n2. ADMISSION AND ALLOTMENT\nHostel accommodation is allotted on a first-come, first-served basis, subject to availability. Students must submit the required documents and fees at the time of admission. Allotment of rooms is at the discretion of the hostel authorities.",
      "tokens": 340,
      "word_count": 230,
      "char_start": 0,
      "char_end": 1350,
      "overlap_with_previous": "no",
      "version": "v1.0",
      "created_at": "2025-11-16T00:00:00Z",
      "source_file": "hostel-rule-book-2025-26.pdf"
    },
    {
      "id": "chunk-002",
      "doc_id": "hostel-rule-book-2025-26.pdf",
      "page_start": 2,
      "page_end": 3,
      "section": "Admission and Allotment",
      "chunk_text": "Students must vacate the hostel within three days of completion of their course or termination of their admission. No resident is allowed to sublet or exchange rooms without prior permission from the hostel warden.\n\n3. CODE OF CONDUCT\nResidents must not engage in any activity that disturbs the peace or safety of others. Consumption of alcohol, drugs, or any illegal substances is strictly prohibited. Any violation will result in immediate expulsion from the hostel.\n\n4. VISITORS\nVisitors are allowed only during specified hours and must register at the hostel reception. No visitor is permitted to stay overnight in the hostel rooms.",
      "tokens": 360,
      "word_count": 240,
      "char_start": 1150,
      "char_end": 2550,
      "overlap_with_previous": "yes",
      "version": "v1.0",
      "created_at": "2025-11-16T00:00:00Z",
      "source_file": "hostel-rule-book-2025-26.pdf"
    },
    {
      "id": "chunk-003",
      "doc_id": "hostel-rule-book-2025-26.pdf",
      "page_start": 3,
      "page_end": 4,
      "section": "Code of Conduct",
      "chunk_text": "Residents are responsible for the conduct of their visitors. Any damage caused by visitors will be charged to the resident concerned.\n\n5. FACILITIES AND MAINTENANCE\nResidents must keep their rooms and common areas clean and tidy. Any maintenance issues should be reported to the hostel office immediately. Residents are not allowed to make any structural changes to the rooms.\n\n6. LEAVE AND ABSENCE\nResidents must inform the hostel warden in writing before leaving the hostel for more than 24 hours. Unauthorized absence may lead to cancellation of hostel accommodation.",
      "tokens": 350,
      "word_count": 235,
      "char_start": 2350,
      "char_end": 3700,
      "overlap_with_previous": "yes",
      "version": "v1.0",
      "created_at": "2025-11-16T00:00:00Z",
      "source_file": "hostel-rule-book-2025-26.pdf"
    },
    {
      "id": "chunk-004",
      "doc_id": "hostel-rule-book-2025-26.pdf",
      "page_start": 4,
      "page_end": 5,
      "section": "Facilities and Maintenance",
      "chunk_text": "Residents must not keep any valuables or large sums of money in their rooms. The hostel authorities will not be responsible for any loss or theft.\n\n7. MESS AND DINING\nAll residents must follow the mess timings and rules. Wastage of food is strictly discouraged. Residents are not allowed to take food outside the dining hall.\n\n8. DISCIPLINARY ACTION\nAny breach of hostel rules will result in disciplinary action, including fines, suspension, or expulsion. The decision of the hostel authorities will be final and binding.",
      "tokens": 340,
      "word_count": 225,
      "char_start": 3550,
      "char_end": 4800,
      "overlap_with_previous": "yes",
      "version": "v1.0",
      "created_at": "2025-11-16T00:00:00Z",
      "source_file": "hostel-rule-book-2025-26.pdf"
    },
    {
      "id": "chunk-005",
      "doc_id": "hostel-rule-book-2025-26.pdf",
      "page_start": 5,
      "page_end": 6,
      "section": "Mess and Dining",
      "chunk_text": "Residents must cooperate with hostel staff during inspections and comply with all instructions issued from time to time.\n\n9. EMERGENCY PROCEDURES\nIn case of fire, medical emergency, or any other crisis, residents must follow the instructions of hostel authorities and emergency services. Emergency contact numbers are displayed on the hostel notice board.\n\n10. AMENDMENTS\nThe hostel authorities reserve the right to amend the rules at any time. Residents will be notified of any changes through official communication channels.",
      "tokens": 320,
      "word_count": 215,
      "char_start": 4650,
      "char_end": 5800,
      "overlap_with_previous": "yes",
      "version": "v1.0",
      "created_at": "2025-11-16T00:00:00Z",
      "source_file": "hostel-rule-book-2025-26.pdf"
    },
    {
      "id": "chunk-006",
      "doc_id": "hostel-rule-book-2025-26.pdf",
      "page_start": 6,
      "page_end": 6,
      "section": null,
      "chunk_text": "All residents are advised to keep a copy of this rule book for reference. For any queries or clarifications, please contact the hostel office during working hours.",
      "tokens": 80,
      "word_count": 55,
      "char_start": 5700,
      "char_end": 5900,
      "overlap_with_previous": "yes",
      "version": "v1.0",
      "created_at": "2025-11-16T00:00:00Z",
      "source_file": "hostel-rule-book-2025-26.pdf"
    }
  ],
  "additional_rules": [
    "After 12:00 AM, residents must ensure that all room lights are switched off. Use of bright illumination at night is prohibited.",
    "A biometric attendance system is installed at the hostel entrance. Residents must register both while entering and exiting, along with signing the register at the hostel and main gates.",
    "Guardians may visit during the day but are not permitted to stay overnight within hostel premises.",
    "Cooking using induction cooktops or kettles inside hostel rooms is officially prohibited, although students commonly disregard this rule.",
    "Residents are issued a hostel ID card, which must be worn at all times when outside their rooms but within the hostel or university premises.",
    "The hostel canteen provides breakfast and snacks on the ground floor, dinner on the first floor, and lunch on the third floor.",
    "The canteen does not serve food without a valid meal coupon and either the hostel or university ID card.",
    "Residents must seek permission before carrying food into their rooms.",
    "After 10:00 PM, roaming within the university campus or outside the hostel premises is strictly prohibited.",
    "For evening outings, residents must return to the university campus between 5:00 PM and 8:00 PM.",
    "Hostel rooms and bathrooms are cleaned daily by the hostel's room service; only the designated subday (e.g., Sunday) is off. Routine room cleaning service is provided on all other days."
  ]
}