[
  {
    "id": "7",
    "section": "University Protocol",
    "title": "Timings & punctuality",
    "text": "University timings 8:00 am to 7:00 pm Mon-Sat; late-comers may be barred from that period; no food/drinks in study areas; smoking/alcohol banned on campus; fines up to INR 10,000 for violations.",
    "source": "student-rule-book-2025-26.pdf",
    "page": "13-15"
  },
  {
    "id": "8",
    "section": "ID Card Rules",
    "title": "Student Identity Card - General Requirements",
    "text": "Physical ID card must be displayed at all times on campus. Soft copy is valid only for the first month for freshers. Misuse of ID cards leads to fines and disciplinary action.",
    "source": "student-rule-book-2025-26.pdf",
    "page": "15-16"
  },
  {
    "id": "8a",
    "section": "ID Card Rules",
    "title": "Lost ID Card Replacement",
    "text": "For lost ID card: File a General Diary (GD) report immediately to Barasat Police Station. Pay INR 150 in cash only (UPI not accepted) to the Accounts Department and obtain payment receipt. Submit receipt and inform at University Building 5, Room 615. Processing takes approximately one week. During this period, present the GD report for campus entry at gates. Upon completion, collect new ID card from Room 611 where faculty will issue the replacement.",
    "source": "student-rule-book-2025-26.pdf",
    "page": "15-16"
  },
  {
    "id": "8b",
    "section": "ID Card Rules",
    "title": "Damaged ID Card Exchange",
    "text": "For damaged ID card exchange: Strap replacement only - INR 50; Complete card replacement - INR 100. Payment must be made in cash only (UPI not accepted) to the Accounts Department and obtain payment receipt. Submit receipt and inform at University Building 5, Room 615. Processing takes approximately one week. During this period, continue using existing damaged ID card for campus entry. Upon completion, collect new ID card from Room 611 where faculty will replace the old card with the new one.",
    "source": "student-rule-book-2025-26.pdf",
    "page": "15-16"
  },
  {
    "id": "9",
    "section": "Dress Code",
    "title": "University dress code",
    "text": "Students must wear university uniform or formal dress on working days; lab coat/apron and shoes required in specific labs; dress violations lead to suspension from classes and fines on repeat offences.",
    "source": "student-rule-book-2025-26.pdf",
    "page": "16"
  },
  {
    "id": "10",
    "section": "Mobile & Laptops",
    "title": "Restricted mobile use & laptop rules",
    "text": "Mobile phones prohibited in academic blocks (classrooms, labs, library); photography without consent prohibited; confiscation and fines for violations. Laptops allowed with prior teacher permission; unauthorised use may lead to confiscation.",
    "source": "student-rule-book-2025-26.pdf",
    "page": "17-18"
  },
  {
    "id": "17",
    "section": "Canteen Rules",
    "title": "Canteen / Food court etiquette",
    "text": "Follow timings, respect queues, avoid wastage, eat in designated areas, keep area clean, follow outside-food policy, avoid excessive noise; report food/hygiene issues.",
    "source": "student-rule-book-2025-26.pdf",
    "page": "25"
  }
]